Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Execute a SQL query against a connection. The connection's safe mode policy applies. Multi-statement queries are rejected. Destructive operations (DROP, TRUNCATE, ALTER...DROP) are blocked here; use confirm_destructive_operation instead.
fr: Exécutez une requête SQL contre une connexion. La politique de mode sûr de la connexion s'applique. Les requêtes à plusieurs déclarations sont rejetées. Les opérations destructrices (DROP, TRUNCATE, ALTER...DROP) sont bloquées ici ; utilisez plutôt confirm_destructive_operation.
ko: 연결에서 SQL 쿼리를 실행합니다. 연결의 안전 모드 정책이 적용됩니다. 여러 문으로 구성된 쿼리는 거부됩니다. 파괴적 작업(DROP, TRUNCATE, ALTER...DROP)은 여기에서 차단되며, 대신 confirm_destructive_operation을 사용하십시오.
tr: Bir bağlantıda SQL sorgusu çalıştırır. Bağlantının güvenli mod politikası uygulanır. Çok deyimli sorgular reddedilir. Yıkıcı işlemler (DROP, TRUNCATE, ALTER...DROP) burada engellenir; bunun yerine confirm_destructive_operation kullanın.
vi: Thực thi truy vấn SQL trên một kết nối. Chính sách chế độ an toàn của kết nối được áp dụng. Truy vấn nhiều câu lệnh sẽ bị từ chối. Các thao tác phá hủy (DROP, TRUNCATE, ALTER...DROP) bị chặn ở đây; hãy dùng confirm_destructive_operation thay thế.
zh_hans: 对连接执行 SQL 查询。受连接的安全模式策略约束。多语句查询会被拒绝。破坏性操作（DROP、TRUNCATE、ALTER...DROP）在此被阻止；请改用 confirm_destructive_operation。
zh_hant: 對連線執行 SQL 查詢。會套用連線的安全模式原則。多陳述式查詢會被拒絕。破壞性操作（DROP、TRUNCATE、ALTER...DROP）在此會被封鎖；請改用 confirm_destructive_operation。

source: Row %@, column “%@” contains %@, which %@ cannot store. Choose Save As and pick UTF-8.
fr: La ligne %@, la colonne "%@" contient %@, que %@ ne peut pas stocker. Choisissez Enregistrer sous et sélectionnez UTF-8.

source: SSH username not set. Add it to the form, or add a User line for %@ in ~/.ssh/config.
fr: Le nom d'utilisateur SSH n'est pas défini. Ajoutez-le au formulaire ou ajoutez une ligne d'utilisateur pour %@ dans ~/.ssh/config.

source: This database type has no dump TablePro can drive.
fr: Ce type de base de données n'a pas de table de décompression que TablePro peut utiliser.

source: Previous Tab (Alt)
fr: Fichier précédent (Alt)
ko: 이전 탭(Alt)
vi: Tab trước (Alt)
zh_hans: 上一个标签页 (Alt)
zh_hant: 上一個分頁 (Alt)

source: AWS rejected the request signature for this profile's credentials.
fr: AWS a rejeté la signature de la demande pour les identifiants de ce profil.

source: Drawing %1$d shapes in SRID %2$d.
fr: Dessiner des formes %1$d dans SRID %2$d.

source: Privacy
fr: Vie privée
ko: 개인정보 보호
vi: Quyền riêng tư
zh_hans: 隐私
zh_hant: 隱私

source: Starred tables, sorted
fr: Tables étoilées, triées
ko: 정렬된 즐겨찾기 테이블
tr: Yıldızlanmış tablolar, sıralı
vi: Các bảng đã đánh dấu sao, đã sắp xếp
zh_hans: 已排序的收藏表
zh_hant: 已排序的收藏資料表

source: This machine is not activated for this license.
fr: Cette machine n'est pas activée pour cette licence.
ko: 이 컴퓨터에서는 이 라이선스가 활성화되어 있지 않습니다.
tr: Bu makine bu lisans için etkinleştirilmemiş.
vi: Máy này chưa được kích hoạt cho giấy phép này.
zh_hans: 此设备未激活该许可证。
zh_hant: 此機器尚未針對此授權啟用。

source: Could not start the sign-in listener. Please try again.
fr: Impossible de démarrer l'écouteur de connexion. Veuillez réessayer.
ko: 로그인 리스너를 시작할 수 없습니다. 다시 시도하십시오.
tr: Oturum açma dinleyicisi başlatılamadı. Lütfen tekrar deneyin.
vi: Không thể khởi động trình lắng nghe đăng nhập. Vui lòng thử lại.
zh_hans: 无法启动登录监听器。请重试。
zh_hant: 無法啟動登入監聽器。請再試一次。

source: This database does not support ON UPDATE %@.
fr: Cette base de données ne prend pas en charge ON UPDATE %@.

source: The connection was closed.
fr: La connexion a été fermée.
ko: 연결이 종료되었습니다.
tr: Bağlantı kapatıldı.
vi: Kết nối đã bị đóng.
zh_hans: 连接已关闭。
zh_hant: 連線已關閉。

source: A column was set to a default or a function, so its stored value is unknown.
fr: Une colonne a été définie sur une valeur par défaut ou une fonction, donc sa valeur stockée est inconnue.
ko: 어떤 열이 기본값이나 함수로 설정되어 저장된 값을 알 수 없습니다.
tr: Bir sütun varsayılana veya bir fonksiyona ayarlandı, bu yüzden saklanan değeri bilinmiyor.
vi: Một cột được đặt thành giá trị mặc định hoặc một hàm, nên giá trị lưu trữ của nó không xác định.
zh_hans: 某个列被设为默认值或函数，因此其存储的值未知。
zh_hant: 某個欄位被設為預設值或函式，因此其儲存的值未知。

source: Reset Filters
fr: Réinitialiser les filtres
ko: 필터 재설정
tr: Filtreleri Sıfırla
vi: Đặt lại bộ lọc
zh_hans: 重置筛选
zh_hant: 重置篩選

source: Copilot server is not running
fr: Le serveur Copilot n'est pas en cours d'exécution.
ko: Copilot 서버가 실행 중이 아닙니다
tr: Copilot sunucusu çalışmıyor
vi: Copilot server không chạy
zh_hans: Copilot 服务器未运行
zh_hant: Copilot 伺服器未執行

source: SQL query to export results from
fr: Requête SQL pour exporter les résultats de
ko: 결과를 내보낼 SQL 쿼리
tr: Sonuçları dışa aktarılacak SQL sorgusu
vi: Truy vấn SQL để xuất kết quả
zh_hans: 要导出结果的 SQL 查询
zh_hant: 要匯出結果的 SQL 查詢

source: Full access including destructive DDL after explicit confirmation.
fr: Accès complet, y compris la DDL destructrice après confirmation explicite.
ko: 명시적으로 확인한 후 파괴적인 DDL까지 허용하는 전체 접근 권한입니다.
tr: Açık onay sonrası yıkıcı DDL dahil tam erişim.
vi: Toàn quyền bao gồm DDL phá hủy sau khi xác nhận rõ ràng.
zh_hans: 完全访问，包含需要明确确认的破坏性 DDL。
zh_hant: 完整存取,包含需明確確認的破壞性 DDL。

source: Trust plugins from %@?
fr: Faites confiance aux plugins de %@?
ko: %@의 플러그인을 신뢰하시겠습니까?
tr: %@ eklentilerine güvenilsin mi?
vi: Tin cậy các plugin từ %@?
zh_hans: 信任来自 %@ 的插件？
zh_hant: 要信任來自 %@ 的外掛嗎？

source: The license has expired.
fr: La licence a expiré.
ko: 라이선스가 만료되었습니다.
tr: Lisansın süresi doldu.
vi: Giấy phép đã hết hạn.
zh_hans: 许可证已过期。
zh_hant: 授權已過期。

source: Compression failed with exit status %d
fr: Échec de la compression avec statut de sortie %d
ko: 압축 실패(종료 상태 %d)
tr: Sıkıştırma %d çıkış koduyla başarısız oldu
vi: Nén thất bại với mã thoát %d
zh_hans: 压缩失败，退出状态 %d
zh_hant: 壓縮失敗,結束狀態 %d

source: Read
fr: Lire
ko: 읽기
tr: Okuma
vi: Đọc
zh_hans: 读取
zh_hant: 讀取

source: This conversation works on one connection, and that is the only one it can reach. Open the other connection and ask there.
fr: Cette conversation fonctionne sur une seule connexion, et c'est la seule qu'elle peut atteindre. Ouvrez l'autre connexion et demandez-y.

source: Selected
fr: Sélectionné

# The %@ line in ~/.ssh/config does not accept the token %@.
source: The %1$@ line in ~/.ssh/config does not accept the token %2$@.
fr: La ligne %1$@ dans ~/.ssh/config n'accepte pas le jeton %2$@.

source: No Connections Imported
fr: Aucune connexion importée
ko: 가져온 연결 없음
tr: Hiçbir Bağlantı İçe Aktarılmadı
vi: Không có Kết nối nào được Nhập
zh_hans: 未导入任何连接
zh_hant: 未匯入任何連線

source: List all saved database connections with their current status.
fr: Liste toutes les connexions de base de données enregistrées avec leur statut actuel.
ko: 저장된 모든 데이터베이스 연결과 현재 상태를 나열합니다.
tr: Kayıtlı tüm veritabanı bağlantılarını geçerli durumlarıyla listeler.
vi: Liệt kê tất cả kết nối cơ sở dữ liệu đã lưu cùng trạng thái hiện tại.
zh_hans: 列出所有已保存的数据库连接及其当前状态。
zh_hant: 列出所有已儲存的資料庫連線及其目前狀態。

source: only in the source
fr: Seulement dans la source

source: Retry Update
fr: Réessayer la mise à jour
ko: 업데이트 재시도
tr: Güncellemeyi Yeniden Dene
vi: Thử cập nhật lại
zh_hans: 重试更新
zh_hant: 重試更新

source: Capabilities:
fr: Capacités :
ko: 기능:
tr: Yetenekler:
vi: Tính năng:
zh_hans: 功能：
zh_hant: 功能：

source: Browse Table
fr: Parcourir la table
ko: 테이블 탐색
tr: Tabloya Göz At
vi: Duyệt bảng
zh_hans: 浏览表
zh_hant: 瀏覽資料表

source: Fill
fr: Remplir
ko: 채우기
tr: Doldur
vi: Điền
zh_hans: 填充
zh_hant: 填入

source: Distributed wide-column store
fr: Stockage à colonnes larges distribué
ko: 분산 와이드 컬럼 저장소
tr: Dağıtık geniş sütunlu depo
vi: Kho wide-column phân tán
zh_hans: 分布式宽列存储
zh_hant: 分散式寬欄儲存

source: Connect
fr: Assurer la correspondance
ko: 연결
tr: Bağlan
vi: Kết nối
zh_hans: 连接
zh_hant: 連線

source: contains
fr: Contient
ko: 포함
tr: içerir
vi: chứa
zh_hans: 包含
zh_hant: 包含

source: This diagram is not bound to a database
fr: Ce diagramme n'est pas lié à une base de données.
ko: 이 다이어그램은 데이터베이스에 연결되어 있지 않습니다
tr: Bu diyagram bir veritabanına bağlı değil
vi: Sơ đồ này không gắn với cơ sở dữ liệu nào
zh_hans: 此图表未绑定到数据库
zh_hant: 此圖表未綁定到資料庫

source: A connection with this name, host, and type already exists.
fr: Une connexion avec ce nom, cet hôte et ce type existe déjà.
ko: 이름, 호스트 및 유형이 같은 연결이 이미 있습니다.
tr: Bu ad, sunucu ve tür ile bir bağlantı zaten var.
vi: Đã tồn tại một kết nối với tên, host và kiểu này.
zh_hans: 已存在同名、同主机和同类型的连接。
zh_hant: 已存在同名稱、同主機與同類型的連線。

source: 1 cell
fr: 1 cellule

source: Its columns pass the 3,072 bytes this engine can index, even with each cut to a prefix.
fr: Ses colonnes dépassent les 3 072 octets que ce moteur peut indexer, même avec chaque coupure en préfixe.

source: Confirm passphrase
fr: Confirmer le mot de passe
ko: 패스프레이즈 확인
tr: Parolayı onayla
vi: Xác nhận cụm mật khẩu
zh_hans: 确认密码短语
zh_hant: 確認密碼短語

source: Edit message
fr: Modifier le message
ko: 메시지 편집
tr: Mesajı düzenle
vi: Chỉnh sửa tin nhắn
zh_hans: 编辑消息
zh_hant: 編輯訊息

source: Every table needs at least one column. Click + to get started
fr: Chaque table a besoin d'au moins une colonne. Cliquez sur + pour commencer.
ko: 모든 테이블에는 열이 하나 이상 있어야 합니다. +를 클릭하여 시작하십시오
tr: Her tablonun en az bir sütuna ihtiyacı vardır. Başlamak için + tıklayın
vi: Mỗi bảng cần ít nhất một cột. Nhấn + để bắt đầu
zh_hans: 每个表至少需要一列。点击 + 开始添加
zh_hant: 每個資料表至少需要一個欄位。點按 + 開始新增

source: Incompatible plugin version
fr: Version du plugin incompatible
ko: 호환되지 않는 플러그인 버전
tr: Uyumsuz eklenti sürümü
vi: Phiên bản plugin không tương thích
zh_hans: 插件版本不兼容
zh_hant: 外掛版本不相容

source: 5,000 rows
fr: 5 000 rangées
ko: 5,000개 행
tr: 5.000 satır
vi: 5.000 dòng
zh_hans: 5,000 行
zh_hant: 5,000 列

source: Scroll to a column and put the cell cursor in it
fr: Faites défiler vers une colonne et placez le curseur de cellule dans celle-ci.

source: Verify CA
fr: Vérifier CA
ko: CA 확인
tr: CA Doğrula
vi: Xác minh CA
zh_hans: 验证 CA
zh_hant: 驗證 CA

source: The transaction on this connection is still open. Commit or roll it back.
fr: La transaction sur cette connexion est toujours ouverte. Commencez-la ou annulez-la.

source: Set CSV Properties…
fr: Définir les propriétés CSV...
ko: CSV 속성 설정…
tr: CSV Özelliklerini Ayarla…
vi: Đặt thuộc tính CSV…
zh_hans: 设置 CSV 属性…
zh_hant: 設定 CSV 屬性…

# %lld statements executed, %lld failed
source: %1$lld statements executed, %2$lld failed
fr: %1$lld déclarations exécutées, %2$lld échouées
ko: %1$lld개 SQL 문 실행됨, %2$lld개 실패
tr: %lld ifade çalıştırıldı, %lld başarısız
vi: Đã thực thi %lld câu lệnh, %lld thất bại
zh_hans: 已执行 %lld 条语句，%lld 条失败
zh_hant: 已執行 %1$lld 條陳述式，%2$lld 條失敗

source: No query ran at least %lld times, which is the minimum for an average to mean anything.
fr: Aucune requête n'a été exécutée au moins %lld fois, ce qui est le minimum pour qu'une moyenne ait un sens.
ko: 평균을 내는 데 필요한 최소 실행 횟수인 %lld회 이상 실행된 쿼리가 없습니다.
tr: Hiçbir sorgu en az %lld kez çalışmadı; ortalamanın anlamlı olması için gereken en az sayı bu.
vi: Không có truy vấn nào chạy ít nhất %lld lần, đây là mức tối thiểu để giá trị trung bình có ý nghĩa.
zh_hans: 没有查询至少运行 %lld 次，而这是平均值有意义所需的最少次数。
zh_hant: 沒有查詢至少執行 %lld 次，而這是平均值有意義所需的最少次數。

source: Saved queries are limited to %@ so they fit in iCloud. Save a query this large as a .sql file instead.
fr: Les requêtes enregistrées sont limitées à %@, donc elles s'adaptent à iCloud. Enregistrez plutôt une requête aussi grande sous forme de fichier .sql.
ko: 저장된 쿼리는 iCloud에 맞도록 %@(으)로 제한됩니다. 이렇게 큰 쿼리는 .sql 파일로 저장하세요.
tr: Kayıtlı sorgular iCloud'a sığması için %@ ile sınırlıdır. Bu kadar büyük bir sorguyu .sql dosyası olarak kaydedin.
vi: Truy vấn đã lưu bị giới hạn ở %@ để vừa với iCloud. Hãy lưu truy vấn lớn như thế này thành tệp .sql.
zh_hans: 为适配 iCloud，已保存的查询最大为 %@。请将这么大的查询另存为 .sql 文件。
zh_hant: 為配合 iCloud，已儲存的查詢最大為 %@。請將這麼大的查詢另存為 .sql 檔案。

source: Enable Cloudflare Tunnel
fr: Activer le tunnel Cloudflare
ko: Cloudflare Tunnel 활성화
tr: Cloudflare Tunnel'ı Etkinleştir
vi: Bật Cloudflare Tunnel
zh_hans: 启用 Cloudflare Tunnel
zh_hant: 啟用 Cloudflare 隧道

source: Install it with “brew install libpq” and link it.
fr: Installez-le avec "brew install libpq" et liez-le.

source: Column: %@
fr: Colonne : %@
ko: 열: %@
tr: Sütun: %@
vi: Cột: %@
zh_hans: 列：%@
zh_hant: 欄位：%@

source: The source's definition could not be read: %@
fr: La définition de la source n'a pas pu être lu : %@

source: CHECK expression as the engine reports it
fr: Vérifier l'expression comme le rapporte le moteur.

source: Limit tool calls per reply
fr: Limiter les appels d'outils par réponse
ko: 답변당 도구 호출 제한
tr: Yanıt başına araç çağrılarını sınırla
vi: Giới hạn số lần gọi công cụ mỗi câu trả lời
zh_hans: 限制每条回复的工具调用次数
zh_hant: 限制每則回覆的工具呼叫次數

source: Differs
fr: Diffère
ko: 다름
tr: Farklı
vi: Khác nhau
zh_hans: 有差异
zh_hant: 有差異

source: Theme Update Failed
fr: Mise à jour du thème échouée
ko: 테마 업데이트 실패
tr: Tema Güncellemesi Başarısız Oldu
vi: Cập nhật theme thất bại
zh_hans: 主题更新失败
zh_hant: 佈景主題更新失敗

source: Database name. Uses the connection's current database when omitted.
fr: Nom de la base de données. Utilise la base de données actuelle de la connexion lorsqu'elle est omise.
ko: 데이터베이스 이름입니다. 생략하면 연결의 현재 데이터베이스를 사용합니다.
tr: Veritabanı adı. Boş bırakıldığında bağlantının geçerli veritabanını kullanır.
vi: Tên cơ sở dữ liệu. Bỏ trống thì dùng cơ sở dữ liệu hiện tại của kết nối.
zh_hans: 数据库名称。省略时使用该连接的当前数据库。
zh_hant: 資料庫名稱。省略時使用該連線的目前資料庫。

source: Could not read the table list. %@
fr: Impossible de lire la liste de la table. %@

source: Enter table name
fr: Entrez le nom de la table
ko: 테이블 이름 입력
tr: Tablo adını girin
vi: Nhập tên bảng
zh_hans: 输入表名
zh_hant: 輸入資料表名稱

source: Database engine
fr: Moteur de base de données
ko: 데이터베이스 엔진
tr: Veritabanı motoru
vi: Engine cơ sở dữ liệu
zh_hans: 数据库引擎
zh_hant: 資料庫引擎

source: The connection is not open.
fr: La connexion n'est pas ouverte.

source: Views, routines and triggers hold no rows, so a data-only copy leaves them out.
fr: Les vues, les routines et les déclencheurs ne contiennent aucune ligne, donc une copie uniquement de données les omet.

source: Import Tunnel Commands?
fr: Importer des commandes de tunnel ?

source: COMMENT
fr: Commentaire

source: Filter databases
fr: Filtrer les bases de données
ko: 데이터베이스 필터링
tr: Veritabanlarını filtrele
vi: Lọc cơ sở dữ liệu
zh_hans: 筛选数据库
zh_hant: 篩選資料庫

source: Not browsable on this connection
fr: Non consultable sur cette connexion
ko: 이 연결에서는 탐색할 수 없음
tr: Bu bağlantıda göz atılamaz
vi: Không duyệt được trên kết nối này
zh_hans: 在此连接上无法浏览
zh_hant: 在此連線上無法瀏覽

source: The statements may or may not be saved. Check the table before running them again.
fr: Les déclarations peuvent être sauvegardées ou non. Vérifiez la table avant de les exécuter à nouveau.

source: Delete token?
fr: Supprimer le jeton ?
ko: 토큰을 삭제하시겠습니까?
tr: Token silinsin mi?
vi: Xóa token?
zh_hans: 删除令牌？
zh_hant: 刪除權杖？

source: Cursor sign-in failed.
fr: Connexion du curseur échouée.
ko: Cursor 로그인에 실패했습니다.
tr: Cursor girişi başarısız oldu.
vi: Đăng nhập Cursor thất bại.
zh_hans: Cursor 登录失败。
zh_hant: Cursor 登入失敗。

source: Could not save a secret to the Keychain. Nothing was changed.
fr: Impossible d'enregistrer un secret dans le porte-clés. Rien n'a été modifié.

source: License Not Yet Confirmed
fr: La licence n'a pas encore été confirmée.
ko: 라이선스가 아직 확인되지 않음
tr: Lisans Henüz Doğrulanmadı
vi: Giấy phép chưa được xác nhận
zh_hans: 许可证尚未确认
zh_hant: 授權尚未確認

source: Drop %lld tables
fr: Supprimer les tables %lld
ko: 테이블 %lld개 삭제
tr: Drop %lld tablo
vi: Xóa %lld bảng
zh_hans: 删除 %lld 个表
zh_hant: 刪除 %lld 個資料表

source: AWS rejected these credentials. Check the profile in ~/.aws/config.
fr: AWS a rejeté ces identifiants. Vérifiez le profil dans ~/.aws/config.

source: Building chart
fr: Construction du graphique
ko: 차트 생성 중
tr: Grafik oluşturuluyor
vi: Đang tạo biểu đồ
zh_hans: 正在生成图表
zh_hant: 正在產生圖表

source: This connection is read only for external clients.
fr: Cette connexion est lue uniquement pour les clients externes.
ko: 이 연결은 외부 클라이언트에 대해 읽기 전용입니다.
tr: Bu bağlantı dış istemciler için salt okunur.
vi: Kết nối này chỉ đọc đối với client bên ngoài.
zh_hans: 此连接对外部客户端为只读。
zh_hant: 此連線對外部用戶端為唯讀。

source: Drop %d tables
fr: Déposer %d tables
ko: 테이블 %d개 삭제
tr: %d tabloyu sil
vi: Xoá %d bảng
zh_hans: 删除%d个表
zh_hant: 刪除 %d 個資料表

source: Disable %@
fr: Désactiver %@
ko: %@ 비활성화
tr: %@ Kapat
vi: Tắt %@
zh_hans: 关闭 %@
zh_hant: 關閉 %@

source: Sent: %@
fr: Envoyé : %@

source: Exclude the AUTO_INCREMENT counter
fr: Exclure le compteur AUTO_INCREMENT
ko: AUTO_INCREMENT 카운터 제외
tr: AUTO_INCREMENT sayacını hariç tut
vi: Bỏ bộ đếm AUTO_INCREMENT
zh_hans: 排除 AUTO_INCREMENT 计数器
zh_hant: 排除 AUTO_INCREMENT 計數器

source: Database Switcher
fr: Interrupteur de base de données
ko: 데이터베이스 전환기
tr: Veritabanı Değiştirici
vi: Chuyển đổi cơ sở dữ liệu
zh_hans: 数据库切换器
zh_hant: 資料庫切換器

source: Update Plugin
fr: Mise à jour du plugin
ko: 플러그인 업데이트
tr: Eklentiyi Güncelle
vi: Cập nhật plugin
zh_hans: 更新插件
zh_hant: 更新外掛

source: No values found
fr: Aucun valeur n'a été trouvée
ko: 값을 찾을 수 없음
vi: Không tìm thấy giá trị
zh_hans: 未找到值
zh_hant: 找不到值

source: Search…
fr: Rechercher...
ko: 검색…
tr: Ara…
vi: Tìm kiếm…
zh_hans: 搜索…
zh_hant: 搜尋…

source: The SSH account cannot read %@.
fr: Le compte SSH ne peut pas lire %@.
ko: SSH 계정이 %@을(를) 읽을 수 없습니다.
tr: SSH hesabı %@ dosyasını okuyamıyor.
vi: Tài khoản SSH không đọc được %@.
zh_hans: 该 SSH 账户无法读取 %@。
zh_hant: 該 SSH 帳號無法讀取 %@。

source: Always 'disconnected' on success
fr: Toujours "déconnecté" sur le succès
ko: 성공 시 항상 'disconnected'
tr: Başarılı olduğunda her zaman 'disconnected'
vi: Luôn là 'disconnected' khi thành công
zh_hans: 成功时始终为 'disconnected'
zh_hant: 成功時一律為 'disconnected'

source: Query timeout in seconds (default 30, max 300)
fr: Délai de temps d'attente de la requête en secondes (par défaut 30, maximum 300)
ko: 쿼리 제한 시간(초, 기본값 30, 최대 300)
tr: Saniye cinsinden sorgu zaman aşımı (varsayılan 30, en çok 300)
vi: Thời gian chờ truy vấn tính bằng giây (mặc định 30, tối đa 300)
zh_hans: 查询超时秒数（默认 30，最大 300）
zh_hant: 查詢逾時秒數（預設 30，最大 300）

source: Hex bytes
fr: Bytes hexadécimaux
ko: 16진수 바이트
tr: Hex bayt
vi: Byte dạng Hex
zh_hans: 十六进制字节
zh_hant: 十六進位位元組

source: High cost
fr: Coût élevé
ko: 높은 비용
tr: Yüksek maliyet
vi: Chi phí cao
zh_hans: 高成本
zh_hant: 高成本

source: Export to File…
fr: Exporter vers un fichier...
ko: 파일로 내보내기…
tr: Dosyaya Aktar…
vi: Xuất ra tệp…
zh_hans: 导出到文件…
zh_hant: 匯出至檔案…

source: Another app changed this file. Discard your unsaved changes and reload?
fr: Une autre application a modifié ce fichier. Supprimez vos modifications non enregistrées et rechargez-le ?

source: This sets %lld loaded rows. Review and Save to apply.
fr: Cela définit le nombre de lignes %lld chargées. Réviser et enregistrer pour appliquer.
ko: 불러온 행을 %lld개로 설정합니다. 적용하려면 검토한 후 저장하십시오.
tr: Bu, yüklenmiş %lld satırın değerini ayarlar. Uygulamak için gözden geçirip kaydedin.
vi: Thao tác này đặt giá trị cho %lld hàng đã tải. Xem lại và Lưu để áp dụng.
zh_hans: 这将设置 %lld 个已加载的行。请检查后保存以应用。
zh_hant: 這會設定 %lld 列已載入的資料。請檢查後儲存以套用。

source: Query History Is Paused
fr: L'historique des requêtes est en pause.
ko: 쿼리 기록이 일시 중지됨
tr: Sorgu Geçmişi Duraklatıldı
vi: Lịch sử truy vấn đang tạm dừng
zh_hans: 查询历史已暂停
zh_hant: 查詢歷史已暫停

source: Previous Page (⌘[)
fr: Page précédente (⌘[)
ko: 이전 페이지(⌘[)
vi: Trang trước (⌘[)
zh_hans: 上一页 (⌘[)
zh_hant: 上一頁 (⌘[)

source: Navigating pages will reload data and discard all unsaved changes.
fr: La navigation des pages rechargera les données et rejettera toutes les modifications non enregistrées.
ko: 페이지를 이동하면 데이터가 다시 로드되고 저장하지 않은 모든 변경 사항이 폐기됩니다.
tr: Sayfa değiştirmek veriyi yeniden yükler ve tüm kaydedilmemiş değişiklikleri siler.
vi: Chuyển trang sẽ tải lại dữ liệu và hủy tất cả thay đổi chưa lưu.
zh_hans: 翻页将重新加载数据并丢弃所有未保存的更改。
zh_hant: 翻頁將重新載入資料並捨棄所有未儲存的變更。

source: Preparing the session
fr: Préparer la session
ko: 세션 준비 중
tr: Oturum hazırlanıyor
vi: Đang chuẩn bị phiên
zh_hans: 正在准备会话
zh_hant: 正在準備工作階段

source: Clear Value Filter
fr: Filtre de valeur clair
ko: 값 필터 지우기
tr: Değer Filtresini Temizle
vi: Xóa bộ lọc giá trị
zh_hans: 清除值筛选
zh_hant: 清除值篩選

source: Save Comparison…
fr: Enregistrer la comparaison...

source: Back
fr: En arrière
ko: 뒤로
tr: Geri
vi: Quay lại
zh_hans: 返回
zh_hant: 返回

source: Showing another result will discard all unsaved changes.
fr: L'affichage d'un autre résultat supprimera toutes les modifications non enregistrées.
ko: 다른 결과를 표시하면 저장하지 않은 변경 사항이 모두 사라집니다.
tr: Başka bir sonucu göstermek kaydedilmemiş tüm değişiklikleri atar.
vi: Hiển thị một kết quả khác sẽ huỷ mọi thay đổi chưa lưu.
zh_hans: 显示另一个结果会丢弃所有未保存的更改。
zh_hant: 顯示另一個結果會捨棄所有未儲存的變更。

source: Switch Database
fr: Changer de base de données
ko: 데이터베이스 전환
tr: Veritabanı Değiştir
vi: Chuyển cơ sở dữ liệu
zh_hans: 切换数据库
zh_hant: 切換資料庫

source: Path
fr: Chemin
ko: 경로
tr: Yol
vi: Đường dẫn
zh_hans: 路径
zh_hant: 路徑

source: TablePro includes these open source libraries. Pick one to read its license.
fr: TablePro comprend ces bibliothèques open source. Choisissez-en une pour lire sa licence.
ko: TablePro에는 다음 오픈 소스 라이브러리가 포함되어 있습니다. 라이선스를 읽으려면 하나를 선택하십시오.
tr: TablePro şu açık kaynak kitaplıkları içerir. Lisansını okumak için birini seçin.
vi: TablePro có kèm các thư viện mã nguồn mở sau. Hãy chọn một thư viện để đọc giấy phép của nó.
zh_hans: TablePro 包含以下开源库。选择其中一个以阅读它的许可证。
zh_hant: TablePro 包含以下開源程式庫。選擇其中一個以閱讀它的授權條款。

source: No primary key. Choose key columns to compare this table.
fr: Pas de clé primaire. Choisissez les colonnes clés pour comparer cette table.
ko: 기본 키가 없습니다. 이 테이블을 비교하려면 키 열을 선택하십시오.
tr: Birincil anahtar yok. Bu tabloyu karşılaştırmak için anahtar sütunlar seçin.
vi: Không có khóa chính. Hãy chọn cột khóa để so sánh bảng này.
zh_hans: 没有主键。请选择键列来比较此表。
zh_hant: 沒有主鍵。請選擇鍵欄位來比較此資料表。

source: Outdent
fr: Dédent
ko: 내어쓰기
tr: Girintiyi Azalt
vi: Giảm thụt lề
zh_hans: 减少缩进
zh_hant: 減少縮排

source: Approve
fr: Approuver
ko: 승인
tr: Onayla
vi: Chấp thuận
zh_hans: 批准
zh_hant: 核准

source: %1$d of %2$d included
fr: %1$d de %2$d inclus
ko: %2$d개 중 %1$d개 포함됨
tr: %1$d / %2$d dahil edildi
vi: Đã bao gồm %1$d trên %2$d
zh_hans: 已包含 %1$d / %2$d
zh_hant: 已納入 %1$d / %2$d

source: Cancel Restore Dump
fr: Annuler la restauration du décompte
ko: 복원 덤프 취소
tr: Döküm Geri Yüklemeyi İptal Et
vi: Hủy khôi phục dump
zh_hans: 取消恢复转储
zh_hant: 取消還原備份

source: Filter Settings…
fr: Paramètres de filtrage...
ko: 필터 설정…
tr: Filtre Ayarları…
vi: Cài đặt bộ lọc…
zh_hans: 筛选设置…
zh_hant: 篩選設定…

source: New Tab
fr: Nouvelle onglet
ko: 새 탭
tr: Yeni Sekme
vi: Tab mới
zh_hans: 新建标签页
zh_hant: 新增分頁

source: The selected axes contain only null, binary, or invalid values.
fr: Les axes sélectionnés ne contiennent que des valeurs nulles, binaires ou invalides.
ko: 선택한 축에 null, 바이너리 또는 유효하지 않은 값만 있습니다.
tr: Seçilen eksenler yalnızca null, ikili veya geçersiz değerler içeriyor.
vi: Các trục đã chọn chỉ chứa giá trị null, nhị phân hoặc không hợp lệ.
zh_hans: 所选坐标轴只包含空值、二进制或无效值。
zh_hant: 所選座標軸只包含空值、二進位或無效值。

source: Column must have a name and a data type
fr: La colonne doit avoir un nom et un type de données.

source: Refresh & Save
fr: Recharger et enregistrer
ko: 새로 고침 및 저장
tr: Yenile ve Kaydet
vi: Làm mới & Lưu
zh_hans: 刷新并保存
zh_hant: 重新整理並儲存

source: This workbook has no worksheets.
fr: Ce livret de travail n'a pas de feuilles de calcul.

source: Reset Layout
fr: Réinitialiser le schéma d'affichage
ko: 레이아웃 재설정
tr: Düzeni Sıfırla
vi: Đặt lại bố cục
zh_hans: 重置布局
zh_hant: 重設版面配置

source: Linked
fr: Lié
ko: 연결됨
tr: Bağlantılı
vi: Đã liên kết
zh_hans: 已链接
zh_hant: 已連結

source: Terminal Unavailable
fr: Terminal indisponible
ko: 터미널을 사용할 수 없음
tr: Terminal Kullanılamıyor
vi: Terminal không khả dụng
zh_hans: 终端不可用
zh_hant: 終端機無法使用
